НП/src/Documents/ПродажаАбонемента/ПродажаАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаАбонемента</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.АбонементыКонтрагентов</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАбонемента</name>
      <type>
        <types>CatalogRef.ВидыАбонементов</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Абонемент</name>
      <type>
        <types>CatalogRef.АбонементыКонтрагента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

НП/src/AccumulationRegisters/АбонементыКонтрагентов/АбонементыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АбонементыКонтрагентов</name>
  <resources>
    <name>ЧислоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>CatalogRef.АбонементыКонтрагента</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

НП/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ДвиженияДенежныхСредств</types>
      <types>DocumentRef.Посещение</types>
      <types>DocumentRef.ПродажаАбонемента</types>
      <types>DocumentRef.РеализацияТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

НП/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

НП/src/Catalogs/АбонементыКонтрагента/АбонементыКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АбонементыКонтрагента</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ВидАбонемента</name>
    <type>
      <types>CatalogRef.ВидыАбонементов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

НП/src/Documents/ПродажаАбонемента/ObjectModule.bsl
//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Абонементы, посещения
	ТаблицаАбонементов = СформироватьТаблицуАбонементов();
	СформироватьДвиженияПоРегистру(ТаблицаАбонементов,Отказ, "АбонементыКонтрагентов");
	
	//Взаиморасчеты
	ТаблицаВзаиморасчетов = СоздатьТаблицуДолгаПоДокументам();
	СформироватьДвиженияПоРегистру(ТаблицаВзаиморасчетов, Отказ, "Взаиморасчеты", Истина);
	ТаблицаОплат		  = СоздатьТаблицуОплатПоДокументам();
	СформироватьДвиженияПоРегистру(ТаблицаОплат, Отказ, "Взаиморасчеты", , "Расход");
	
	//Денежные средства
	ТаблицаДС = СоздатьТаблицуДенежныхСредств();
	СформироватьДвиженияПоРегистру(ТаблицаДС, Отказ, "ДенежныеСредства");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Отказ Тогда
		СоздатьНовыеАбонементы();
		
		КраткийСоставДокумента = "";
		ДЛя Каждого ТекСтрока Из Контрагенты Цикл
			КраткийСоставДокумента = КраткийСоставДокумента + ", "+ТекСтрока.Контрагент;
		КонецЦикла;
		КраткийСоставДокумента = Сред(КраткийСоставДокумента,3, СтрДлина(КраткийСоставДокумента)-2);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьНовыеАбонементы()
	Для Каждого ТекСтрока Из Контрагенты Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.Абонемент) Тогда
			НовыйАбонемент = Справочники.АбонементыКонтрагента.СоздатьЭлемент();
			НовыйАбонемент.Владелец = ТекСтрока.Контрагент;
			НовыйАбонемент.ДатаНачала = Дата;
			НовыйАбонемент.ВидАбонемента = ТекСтрока.ВидАбонемента;
			НовыйАбонемент.Записать();
			
			ТекСтрока.Абонемент = НовыйАбонемент.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Функция СформироватьТаблицуАбонементов()
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
	ОписаниеЧисла = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	
	ТабАбонементов = Контрагенты.Выгрузить();
	ТабАбонементов.Свернуть("Контрагент, Абонемент, ВидАбонемента","Стоимость");
	ТабАбонементов.Колонки.Добавить("ЧислоПосещений", ОписаниеЧисла);
	
	Для Каждого ТекСтрока Из ТабАбонементов Цикл
		ТекСтрока.ЧислоПосещений = ТекСтрока.ВидАбонемента.КоличествоПосещений;
	КонецЦикла;
	
	Возврат ТабАбонементов;
	 
КонецФункции

Процедура СформироватьДвиженияПоАбонементамКонтрагента(ТаблицаАбонементов, Отказ)

	// ПО РЕГИСТРУ Абонементы контрагентов.
	
	НаборДвижений = Движения.АбонементыКонтрагентов;
	НаборДвижений.Записывать = Истина;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	// Заполним таблицу движений.
	ОбщегоНазначенияНП.ЗагрузитьВТаблицуЗначений(ТаблицаАбонементов, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	// Недостающие поля.
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		
		НаборДвижений.ВыполнитьПриход();
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьТаблицуДолгаПоДокументам()
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
	ОписаниеЧисла = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	
	ТаблицаВзаиморасчетов = Контрагенты.Выгрузить();
	ТаблицаВзаиморасчетов.Свернуть("Контрагент","Стоимость");
	
	ТаблицаДвижений = Движения.Взаиморасчеты.Выгрузить();
	Для Каждого ТекСтрока Из ТаблицаВзаиморасчетов Цикл
		НовСтр = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ТекСтрока);
		НовСтр.СуммаВзаиморасчетов = ТекСтрока.Стоимость;
	КонецЦикла;
	
	НовТаблицаДвижений = ДобавленныеФункции.РаспределитьОплатуПоРасчетнымДокументам(Ссылка, ТаблицаДвижений, Ложь);
	
	Возврат НовТаблицаДвижений;
	
КонецФункции

Функция СоздатьТаблицуОплатПоДокументам()
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
	ОписаниеЧисла = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	
	ТаблицаВзаиморасчетов = Контрагенты.Выгрузить();
	ТаблицаВзаиморасчетов.Свернуть("Контрагент","Оплачено");
	
	ТаблицаДвижений = Движения.Взаиморасчеты.Выгрузить();
	ТаблицаДвижений.Очистить();
	Для Каждого ТекСтрока Из ТаблицаВзаиморасчетов Цикл
		НовСтр = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ТекСтрока);
		НовСтр.СуммаВзаиморасчетов = ТекСтрока.Оплачено;
	КонецЦикла;
	
	НовТаблицаДвижений = ДобавленныеФункции.РаспределитьОплатуПоРасчетнымДокументам(Ссылка, ТаблицаДвижений, Истина);
	
	Возврат НовТаблицаДвижений;
	
КонецФункции

Функция СоздатьТаблицуДенежныхСредств()
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
	ОписаниеЧисла = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	
	ТаблицаДвижений = Движения.ДенежныеСредства.Выгрузить();
	НовСтр = ТаблицаДвижений.Добавить();
	
	НовСтр.Сумма = Контрагенты.Итог("Оплачено");
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Процедура СформироватьДвиженияПоРегистру(Таблица, Отказ, ИмяРегистра, ПромежуточноЗаписать=Ложь, ВидДвижения = "Приход")

	// ПО РЕГИСТРУ Взаиморасчеты.
	
	НаборДвижений = Движения[ИмяРегистра];
	НаборДвижений.Записывать = Истина;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	// Заполним таблицу движений.
	ОбщегоНазначенияНП.ЗагрузитьВТаблицуЗначений(Таблица, ТаблицаДвижений);
	
	// Недостающие поля.
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		
		Если ВидДвижения = "Приход" Тогда
			НаборДвижений.ВыполнитьПриход();
		Иначе
			НаборДвижений.ВыполнитьРасход();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПромежуточноЗаписать ТОгда
		НаборДвижений.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//#КонецЕсли
